## VSCodeのインストール

1. [こちら](https://code.visualstudio.com/)からインストーラをダウンロードしてください
2. インストーラを起動してください
3. 規約に同意し、PATHへの追加にチェック（その他はお任せ）を入れ、次へ
4. インストール
5. インストール完了後必要であればPCを再起動してください

## VSCodeのセットアップ

1. [プロファイル](./ggg-alpha.code-profile)をダウンロードしてください
2. VSCodeを起動して、キーボードのaltを押しながらf -> pを押してください
3. `プロファイル（既定）`にマウスオーバーし、表示された選択肢の一番下の`プロファイル(&P)`をクリックしてください
4. 青い`新しいプロファイル`ボタンの右にある、青い`⋁`ボタンをクリックし、`プロファイルのインポート`をクリックしてください
5. コマンドパレットが画面上部に開くので、`ファイルの選択`をクリックして、先ほどダウンロードしたプロファイルを選択してください
6. 画面真ん中の`コンテンツ`セクションの`ソース`カラムの部分をすべて`ggg-alpha`に設定してください
7. 青い`作成`ボタンをクリックして作業が完了するまで待機してください
8. 完了したらキーボードのctrlを押しながらwを押してください
9. キーボードのaltを押しながらf -> pを押してください
10. `プロファイル（既定）`にマウスオーバーし、表示された選択肢の中の`ggg-alpha`を選択してください
11. [設定](./settings.json)をコピーしてください
12. キーボードのctrlを押しながら,を押してください
13. 右上（X印の左下らへん）にある`設定（JSON）を開く`をクリックしてください
14. コピーした設定を貼り付けてキーボードのctrlを押しながらsを押して保存してください
15. 上のバーが赤っぽくなったら成功です
16. キーボードのctrlを押しながらk -> oを押してプロジェクトフォルダを開いて開発を始めましょう！
